#+title: Simulation of Queueing processes in continuous time
#+author: Nicky D. van Foreest
#+date: 2022:01:19

#+STARTUP: indent
#+STARTUP: showall
#+PROPERTY: header-args:python :eval no-export
# +PROPERTY: header-args:python :session  :exports both   :dir "./figures/" :results output


#+OPTIONS: toc:nil author:nil date:nil title:t

#+LATEX_CLASS: subfiles
#+LATEX_CLASS_OPTIONS: [assignments]

#+begin_src emacs-lisp :exports results :results none :eval export
  (make-variable-buffer-local 'org-latex-title-command)
  (setq org-latex-title-command (concat "\\chapter{%t}\n"))
#+end_src



** Arrival times


\begin{exercise}
Why do we generate first random inter-arrival times, and use these to compute the arrival times? Why not directly generate random arrival times?
\end{exercise}

#+begin_src python
A = X.cumsum()
print(A)
#+end_src

#+RESULTS:
| 2.40084716 | 6.0953707 | 7.12666691 | 9.27178782 | 15.97508026 | 22.77363983 | 23.17624146 | 23.8729566 | 24.03147334 | 25.77527041 |


Check the output to see that the arrival time of job 0 is $A_0 > 0$. But I want time to start at time $A_0=0$.  Here is the trick to achieve that.

#+begin_src python
X[0] = 0
A = X.cumsum()
print(A)
#+end_src


#+begin_exercise
1. Why is this better?
2. Why can we remove  ~X[0]~ without fundementally changing the analysis?
#+begin_hint
The $X_{k}$ are iid.
#+end_hint
#+end_exercise


** Server KPI: busy time

We also like to know how a long the server has to work uninterruptedly. Finding the busy times is quite a bit harder than the idle times. (A busy time starts when a job arrives at an empty system and it stops when the server becomes free again.)

#+begin_exercise
To help you understand the code, let's first do a numerical example.
Suppose jobs $1, 4, 8$ find an empty system upon /arrival/. The simulation contains 10 jobs. Why do jobs $3, 7, 10$ leave an empty system behind upon /departure/?
#+end_exercise

With this idea, we can compute the idle times in another way (as a check on earlier work), and then we extend the approach to the busy times.

#+begin_src python
import numpy as np

np.set_printoptions(suppress=True)
np.random.seed(3)

num = 10
labda = 3
X = np.random.exponential(scale=1 / labda, size=num)
X[0] = 0
A = X.cumsum()
mu = 1.2 * labda
S = np.random.exponential(scale=1 / mu, size=len(A))
S[0] = 0
D = np.zeros_like(A)

for k in range(1, len(A)):
    D[k] = max(D[k - 1], A[k]) + S[k]


W = D - S - A # waiting times
idx = np.argwhere(np.isclose(W, 0))
idx = idx[1:]  # strip A[0]
idle_times = np.maximum(A[idx] - D[idx - 1], 0)
print(idle_times.sum())
#+end_src

#+RESULTS:
: 1.3992207179039684

#+begin_exercise
What is stored in ~idx~?  Why do we strip ~A[0]~? Why do we subtract ~D[idx-1]~ and not ~D[idx]~? (Print out the variables to understand what they mean, e.g., ~print(idx)~.)
#+end_exercise


Now put the next piece of code behind the previous code so that we can compute the busy times.

#+begin_src python
busy_times = D[idx - 1][1:] - A[idx][:-1]
last_busy = D[-1] - A[idx[-1]]
print(busy_times.sum() + last_busy, S.sum())
#+end_src

#+begin_exercise
Explain these lines. About the last line, explain why this acts as a check.
#+end_exercise


